## Terraform Plan Essential Output
```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # azurerm_network_security_group.example[0m will be created
[0m  [32m+[0m[0m resource "azurerm_network_security_group" "example" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "northeurope"
      [32m+[0m[0m name                = "example-nsg"
      [32m+[0m[0m resource_group_name = "example-rg"
      [32m+[0m[0m security_rule       = (known after apply)
    }

[1m  # azurerm_resource_group.example[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "example" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "northeurope"
      [32m+[0m[0m name     = "example-rg"
    }

[1m  # azurerm_route_table.example[0m will be created
[0m  [32m+[0m[0m resource "azurerm_route_table" "example" {
      [32m+[0m[0m disable_bgp_route_propagation = false
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "example-route-table"
      [32m+[0m[0m resource_group_name           = "example-rg"
      [32m+[0m[0m route                         = (known after apply)
      [32m+[0m[0m subnets                       = (known after apply)
    }

[1m  # azurerm_subnet.example[0m will be created
[0m  [32m+[0m[0m resource "azurerm_subnet" "example" {
      [32m+[0m[0m address_prefixes                               = [
          [32m+[0m[0m "10.0.1.0/24",
        ]
      [32m+[0m[0m enforce_private_link_endpoint_network_policies = (known after apply)
      [32m+[0m[0m enforce_private_link_service_network_policies  = (known after apply)
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m name                                           = "internal"
      [32m+[0m[0m private_endpoint_network_policies_enabled      = true
      [32m+[0m[0m private_link_service_network_policies_enabled  = true
      [32m+[0m[0m resource_group_name                            = "example-rg"
      [32m+[0m[0m service_endpoints                              = [
          [32m+[0m[0m "Microsoft.Storage",
        ]
      [32m+[0m[0m virtual_network_name                           = "example-vnet"
    }

[1m  # azurerm_subnet_network_security_group_association.example[0m will be created
[0m  [32m+[0m[0m resource "azurerm_subnet_network_security_group_association" "example" {
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m network_security_group_id = (known after apply)
      [32m+[0m[0m subnet_id                 = (known after apply)
    }

[1m  # azurerm_subnet_route_table_association.example[0m will be created
[0m  [32m+[0m[0m resource "azurerm_subnet_route_table_association" "example" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # azurerm_virtual_network.example[0m will be created
[0m  [32m+[0m[0m resource "azurerm_virtual_network" "example" {
      [32m+[0m[0m address_space       = [
          [32m+[0m[0m "10.0.0.0/16",
        ]
      [32m+[0m[0m dns_servers         = (known after apply)
      [32m+[0m[0m guid                = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "northeurope"
      [32m+[0m[0m name                = "example-vnet"
      [32m+[0m[0m resource_group_name = "example-rg"
      [32m+[0m[0m subnet              = (known after apply)
    }

[1mPlan:[0m 7 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```
